61
35
19
17
16
17
20
17
16
15
24
18
17
16
20
17
16
16
16
15
14
16
14
17
15
15
13
26
15
29
13
20
16
46
27
26
41
26
24
24
11
10
7
10
11
13
27
25
32
37
26
31
31
11
27
28
27
25
24
28
25
32
22
41
24
34
43
42
32
14
14
12
11
15
15
13
24
12
13
15
15
12
15
12
14
14
14
13
12
12
11
11
14
14
21
17
14
14
14
21
12
13
19
17
16
16
13
11
19
13
12
11
15
11
11
14
18
15
16
16
18
11
12
12
18
16
14
18
15
9
10
15
11
14
15
21
17
17
13
16
16
13
15
13
14
10
13
11
11
13
15
15
18
14
14
14
17
17
38
38
15
12
18
12
15
15
14
12
12
13
13
14
13
16
12
12
18
13
11
13
17
13
14
12
23
9
22
16
16
14
11
11
11
19
24
21
17
14
13
12
13
15
12
12
11
18
18
18
12
14
10
17
15
13
14
15
16
16
15
15
19
17
10
14
18
24
27
24
10
10
27
13
26
21
15
9
13
13
12
12
13
22
22
11
11
16
16
10
14
15
12
11
13
12
14
15
14
15
17
15
13
11
12
14
17
16
15
15
15
16
14
14
16
18
18
10
15
13
13
12
15
15
15
15
11
19
19
11
11
13
14
15
10
13
13
13
13
16
18
13
17
18
15
13
12
12
12
12
14
17
13
15
13
13
14
16
17
17
17
15
16
15
16
13
14
17
11
17
17
17
17
15
19
13
16
10
17
15
20
23
12
13
13
15
25
11
25
11
14
12
10
12
13
12
14
13
15
14
16
11
15
16
12
16
16
15
9
11
14
16
13
11
12
19
15
15
14
16
13
20
14
13
13
16
18
10
14
11
15
15
12
14
14
10
16
19
14
14
13
16
12
10
11
13
15
18
15
16
10
13
14
13
12
13
13
11
14
14
14
12
18
13
14
12
14
12
14
15
15
11
16
14
15
15
12
11
14
16
15
16
13
12
11
12
13
14
15
14
13
15
14
17
11
12
12
14
13
14
12
15
12
13
13
21
14
13
13
15
13
12
14
11
12
17
14
13
13
11
13
12
14
10
15
13
12
13
13
12
15
11
16
15
13
14
13
19
14
16
15
16
16
13
10
16
13
17
17
10
19
15
15
16
14
16
14
11
16
8
18
17
15
18
16
15
10
12
12
14
14
14
19
12
15
20
19
21
24
23
25
24
28
26
23
23
22
30
29
22
26
20
26
27
20
28
30
29
37
23
17
19
22
14
14
30
18
25
31
23
26
19
20
29
29
16
47
49
33
30
30
37
26
33
30
27
25
31
26
28
28
28
27
33
33
29
38
27
34
38
39
46
46
41
45
43
46
40
45
46
44
46
46
39
43
47
43
39
44
49
28
31
21
29
21
25
28
47
33
31
26
23
29
33
47
38
29
31
42
43
31
35
31
32
22
25
28
46
39
25
24
18
20
29
46
35
24
24
24
19
29
49
36
31
30
28
27
36
46
43
46
47
43
42
44
38
37
46
38
46
43
42
44
40
33
27
36
27
30
31
21
21
19
19
18
17
28
28
24
23
19
19
35
35
27
27
18
18
19
35
35
41
21
21
32
24
23
24
39
40
31
27
23
21
23
23
22
35
35
35
26
26
25
18
18
18
28
36
35
35
28
25
30
19
16
19
34
35
34
20
21
25
32
32
32
41
37
37
23
23
26
29
30
34
34
34
34
19
19
16
17
16
14
26
24
17
30
26
16
16
17
20
50
24
31
31
26
34
34
27
31
30
27
35
33
24
35
35
26
40
40
26
36
35
28
34
33
31
41
42
20
28
28
26
40
40
29
36
37
30
39
40
25
33
34
24
40
39
39
23
23
23
41
23
23
23
41
22
22
22
42
23
23
23
46
27
27
27
41
25
25
25
43
27
27
27
45
32
32
32
42
26
26
26
43
25
25
25
47
26
26
26
30
26
26
24
25
25
25
37
37
37
30
30
25
25
25
24
24
24
22
22
27
27
49
48
26
39
19
30
30
29
26
48
22
21
41
26
31
22
32
23
30
24
22
26
33
27
36
34
25
35
27
27
29
28
24
35
24
28
33
23
28
26
37
26
41
36
14
19
17
15
17
29
25
25
15
15
15
15
23
27
29
27
30
46
12
13
14
15
12
14
18
16
45
40
36
35
25
48
26
26
26
41
26
30
44
30
41
39
36
35
45
45
42
41
20
43
20
37
26
28
47
45
39
23
41
34
43
30
40
39
38
42
42
41
40
18
30
23
32
45
41
30
34
25
21
20
20
21
28
29
30
19
19
29
26
24
27
20
21
28
20
34
32
31
22
22
18
18
22
37
36
27
22
32
24
39
31
36
26
48
36
29
54
33
59
31
49
45
38
48
38
54
48
48
30
56
33
35
53
35
31
35
28
32
23
34
25
24
48
41
45
31
40
33
26
25
19
39
29
33
22
28
24
30
35
34
18
30
26
24
36
31
27
25
22
23
22
25
28
39
25
32
25
32
36
39
25
21
21
24
23
25
24
24
28
26
20
21
30
33
20
25
20
29
16
22
30
25
18
28
31
25
18
26
16
22
36
33
29
27
24
20
32
24
34
25
33
20
37
27
34
36
52
31
39
23
43
17
25
18
35
24
22
36
29
33
31
23
19
30
28
20
23
25
22
28
13
20
14
21
14
21
19
15
25
18
30
17
22
21
22
22
20
25
20
21
15
22
42
37
38
40
28
27
25
23
49
50
48
51
50
51
31
34
34
29
31
36
47
41
39
43
37
21
36
36
32
36
28
38
36
29
42
42
24
35
36
27
39
40
23
36
35
35
26
33
35
30
36
36
20
34
34
29
44
44
25
38
38
28
38
39
23
32
32
29
38
37
24
38
38
26
35
35
30
20
28
27
30
19
28
23
23
23
24
28
21
20
17
17
26
26
24
31
22
21
22
22
36
29
33
28
27
25
28
22
29
25
25
29
28
30
27
25
31
26
30
28
29
33
35
31
22
30
28
30
41
47
45
42
14
16
16
15
14
13
12
15
13
15
15
13
35
31
32
29
27
28
30
30
28
28
25
26
32
46
33
30
28
29
40
33
43
33
29
27
29
24
33
45
25
33
33
39
47
37
29
31
33
26
28
28
26
23
21
24
19
28
26
26
22
33
30
28
27
28
25
28
25
26
21
27
27
27
28
29
25
28
25
27
21
30
21
27
25
31
30
26
24
27
26
27
22
26
25
28
25
27
24
20
25
23
24
37
39
33
34
30
27
25
18
22
16
28
30
45
46
38
37
38
34
38
37
35
37
42
35
37
35
37
35
36
34
44
46
46
45
45
45
45
46
46
46
46
47
47
43
43
19
25
28
29
24
23
23
25
26
25
23
25
25
27
30
29
29
32
32
20
28
28
29
30
32
28
31
35
33
19
26
20
22
23
27
32
23
30
28
31
20
31
28
25
36
35
28
23
33
34
35
30
29
40
31
32
44
28
33
43
40
30
23
44
26
29
43
29
30
46
31
36
41
44
44
43
42
42
46
44
38
44
41
44
45
43
39
46
40
43
42
35
36
25
35
27
42
29
42
22
40
26
42
21
42
35
31
40
42
42
40
38
46
39
38
40
40
29
36
23
45
43
27
45
32
25
26
34
29
39
24
30
24
41
23
32
27
33
34
37
39
43
37
43
36
26
27
35
34
37
42
35
36
37
40
30
16
40
42
39
42
32
39
31
39
31
33
28
30
26
30
38
38
29
32
33
50
46
23
22
21
25
20
24
48
30
34
38
38
42
42
51
40
25
26
31
22
51
25
23
23
22
23
27
24
25
32
24
27
27
26
21
29
27
25
33
29
33
25
30
39
26
30
31
26
28
20
26
30
17
25
32
37
26
31
36
31
16
35
17
16
37
18
33
33
14
16
26
30
17
14
24
27
15
25
32
37
26
31
29
15
23
13
21
22
17
29
14
22
14
16
24
23
12
24
31
21
14
31
32
30
31
31
42
47
32
21
36
37
33
34
31
26
30
31
29
51
41
36
47
40
48
36
22
26
29
36
31
29
32
25
32
24
43
32
42
50
50
50
35
37
38
36
33
39
38
42
38
37
43
31
42
39
41
36
42
28
25
31
26
24
30
28
24
30
25
33
37
30
27
25
24
26
22
22
29
49
48
26
29
23
30
23
29
22
28
23
29
27
29
25
31
27
32
32
36
26
31
49
33
31
38
27
39
29
42
51
32
41
41
37
36
39
47
47
47
47
29
31
35
37
36
32
30
30
34
28
32
31
45
32
31
31
25
28
26
31
27
22
34
32
18
15
18
23
23
23
21
18
25
21
23
22
21
18
13
19
13
13
20
14
15
21
20
16
18
18
48
31
32
35
34
35
32
32
38
27
38
33
29
33
35
29
26
29
31
33
41
32
34
30
29
31
38
32
27
36
34
36
35
31
30
32
37
21
25
34
35
50
48
52
28
28
27
27
31
29
33
34
33
29
13
28
19
20
20
23
25
21
29
18
18
19
22
20
22
28
25
19
18
24
27
24
19
20
22
35
31
34
28
32
30
28
35
35
14
33
32
37
34
27
32
23
30
32
31
33
33
35
34
32
34
33
33
32
35
36
33
31
41
45
45
45
46
44
47
44
48
43
36
46
44
44
47
44
41
46
46
40
47
44
46
45
45
42
47
27
22
29
24
22
28
25
24
21
27
19
26
23
22
24
30
23
31
23
21
22
26
30
24
44
47
44
44
45
48
47
43
29
28
33
29
26
30
25
24
27
31
27
33
31
27
25
30
35
32
28
29
34
28
32
26
31
32
35
27
28
30
27
31
33
29
29
33
39
30
28
33
25
28
30
29
27
28
33
27
46
45
46
48
46
